# Core shell and CLI tooling
zsh
starship
fzf
ripgrep
fd
eza
bat
zoxide
direnv
atuin
zsh-autocomplete
zsh-autosuggestions
zsh-completions
zsh-history-substring-search
zsh-syntax-highlighting
jq
tldr
git
github-cli
lazygit
duf
dust
procs
yazi
zellij
hyperfine
pipx|python-pipx
shellcheck
curl
wget
unzip
zip

# Hyprland / Wayland stack
hyprland
hyprlock
hypridle
hyprpaper
hyprpicker
hyprsunset
hyprcursor
hyprpolkitagent
waybar
rofi-wayland|rofi
swaync
wev
kanshi
swww
nwg-dock-hyprland
grim
slurp
swappy
wf-recorder
wl-clipboard
cliphist
brightnessctl
playerctl
pavucontrol
network-manager-applet
blueman
polkit-gnome
xdg-desktop-portal
xdg-desktop-portal-hyprland
xdg-desktop-portal-gtk
qt5-wayland
qt6-wayland
nwg-look
qt5ct
qt6ct
kvantum

# UI polish and fonts
ttf-jetbrains-mono-nerd
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
papirus-icon-theme
fastfetch
timeshift

# Performance and diagnostics
btop
nvtop
gamemode
lib32-gamemode
mangohud
lib32-mangohud
gamescope
power-profiles-daemon
pipewire
pipewire-pulse
wireplumber
pacman-contrib
vulkan-tools
vulkan-icd-loader
libva
libva-utils
intel-media-driver|libva-intel-driver
swayosd
flatpak
ufw
mpv
easyeffects
