# Core shell and CLI tooling
zsh
starship
fzf
ripgrep
fd
eza
bat
zoxide
direnv
atuin
zsh-autocomplete
zsh-autosuggestions
zsh-completions
zsh-history-substring-search
zsh-syntax-highlighting
jq
tldr
tealdeer
navi
tokei
dog
man-db
man-pages
git
github-cli
git-delta
tmux
neovim
lua-language-server
stylua
typescript
typescript-language-server
eslint
prettier
pyright
python-black
python-isort
ruff
go
gopls
lldb
rustup
rust-analyzer
yaml-language-server
taplo-cli
shfmt
code
helix
lazygit
lazydocker
duf
dust
dua-cli
procs
bottom
yazi
ffmpegthumbnailer
unarchiver
broot
onefetch
chafa
xh
pgcli
obsidian
rofi-calc
zellij
hyperfine
pipx|python-pipx
shellcheck
cmake
cpio
strace
lsof
sd
curl
wget
unzip
zip

# KDE / Plasma companion apps (minimal Plasma alongside Hyprland)
dolphin
gwenview
ark
kcalc
spectacle
okular
kdeconnect
systemsettings
kde-cli-tools
plasma-desktop
plasma-workspace
plasma-nm
plasma-pa
bluedevil
kscreen
dolphin-plugins
ffmpegthumbs

# Hyprland / Wayland stack
hyprland
hyprlock
hypridle
hyprpaper
hyprpicker
hyprsunset
hyprcursor
hyprpolkitagent
waybar
rofi-wayland|rofi
swaync
wev
kanshi
swww
grim
slurp
swappy
satty
wf-recorder
tesseract
tesseract-data-eng
wl-clipboard
cliphist
udiskie
brightnessctl
playerctl
pavucontrol
network-manager-applet
blueman
polkit-gnome
xdg-desktop-portal
xdg-desktop-portal-hyprland
xdg-desktop-portal-gtk
qt5-wayland
qt6-wayland
nwg-look
qt5ct
qt6ct
kvantum
libcanberra
gnome-keyring
seahorse

# UI polish and fonts
ttf-jetbrains-mono-nerd
inter-font
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
otf-font-awesome
papirus-icon-theme
fastfetch
timeshift

# Performance and diagnostics
btop
nvtop
lnav
iotop
iftop
nethogs
gamemode
lib32-gamemode
mangohud
lib32-mangohud
gamescope
power-profiles-daemon
pipewire
pipewire-pulse
wireplumber
pkgfile
pacman-contrib
bleachbit
smartmontools
nvme-cli
vulkan-tools
vulkan-icd-loader
libva
libva-utils
intel-media-driver|libva-intel-driver
swayosd
flatpak
ufw
mpv
easyeffects
qpwgraph
android-udev
scrcpy
